Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: This will initiate the testing suite and you will see Firefox open automatically and perform the actions specified in the acceptance tests.
ja: テストスイートを初期化して、Firefoxを自動的に開き、受入テストで指定されたアクションを実行します。

source: List of asset Hooks:
ja: アセットのフックのリスト:

source: - Purpose: **Update swimlane properties**
ja: - 用途: **スイムレーンのプロパティのアップデート**

source: With the filter given as example above, Kanboard will search for groups that match the query.
ja: 先に例示したフィルターによって、Kanboardはクエリにマッチするグループを検索します。

source: Search by the due date ~~~~~~~~~~~~~~~~~~~~~~
ja: 起源で検索 ~~~~~~~~~~~~~~~~~~~~~~

source: - Only Administrators and Application Managers can create team projects.
ja: - システム管理者と組織の管理者のみがチームプロジェクトを作成できます。

source: # Run tests with Postgres
ja: # PostgreSQLでのテスト

source: However, you can always access to the list of closed tasks by using the query **status:closed** in any search form or simply choose **Closed tasks** from the filter drop-down.
ja: しかしながら、検索フォームで **status:closed** のクエリを使用して検索するか、単純にフィルタのドロップダウンから **完了タスク** を選択すれば、完了済みタスクのリストにはいつでもアクセスできます。

source: - Choose action: **Assign automatically a color based on a category**
ja: - アクション: **カテゴリに基いて色を変える** を選択

source: Run other migrations
ja: その他のマイグレーションを実行する。

source: figure:: /_static/add_new_restriction.png :alt: Add a new restriction
ja: figure:: /_static/add_new_restriction.png :alt: 新しい制限を追加

source: // LDAP attribute to find groups in user profile
ja: // LDAP 属性でユーザーのプロフィールからグループを見つける

source: Unzip the Apache24 folder to ``C:\Apache24``
ja: Apache24 を ``C:\Apache24`` に展開する

source: # Run tests with Sqlite
ja: # Sqliteでのテスト

source: Integration Tests -----------------
ja: 結合テスト -----------------

source: You should include and deploy plugins with your own copy of Kanboard.
ja: 自身のKanboardのコピーにプラグインを含めて展開することもできます。

source: Create a custom ``config.php`` file or copy the ``config.default.php`` file:
ja: カスタム ``config.php`` ファイルを作成するか、 ``config.default.php`` ファイルをコピーします:

source: Synchronization ---------------
ja: 同期 ---------------

source: // Default domain to use for setting the email address
ja: // Emailアドレスとして設定するように使用するデフォルトのドメイン

source: If you have installed some plugins, use the latest version 5.
ja: プラグインをインストールしている場合、最新版にアップデートする 5.

source: - Find comments that contains this title:
ja: - コメントに含まれる内容を検索します:

source: // Mysql/Postgres password define('DB_PASSWORD', '');
ja: // Mysql/Postgres でのパスワード define('DB_PASSWORD', '');

source: - Add screenshots
ja: - スクリーンショットを付ける

source: - Estimation is optional
ja: - 見積は任意

source: Input format used for date fields, for examples the due date for tasks.
ja: 例えばタスクの期限などの、日付フィールドの入力の書式を設定します。

source: - Result on success: **user_id**
ja: - 成功時の返り値: **user_id**

source: - Query with the username: ``assignee:fguillot``
ja: - ユーザー名で検索: ``assignee:fguillot``

source: - Purpose: **Remove a group**
ja: - 用途: **グループの削除**

source: The configuration panel is located on the project listing page - just click on the link **Automatic actions**.
ja: この設定パネルの場所は、「このプロジェクトの設定」→「 **自動アクションの管理** 」です。

source: Template names prefixed with the plugin name and colon indicate the location of the template.
ja: テンプレート名はプラグイン名の接頭辞で、コロン(:)でテンプレートの場所を示します。

source: // We define our server settings define('MAIL_SMTP_HOSTNAME', 'mail.example.com'); define('MAIL_SMTP_PORT', 25);
ja: // サーバーの設定を定義する define('MAIL_SMTP_HOSTNAME', 'mail.example.com'); define('MAIL_SMTP_PORT', 25);

source: - **content** Markdown content (string, required)
ja: - **content** 本文をMarkdown で記述 (string, 必須)

source: To add a new image, take your screenshot and paste with CTRL+V or Command+V:
ja: 新しい画像を追加するには、スクリーンショットを取って、Ctrl+Vか、Command+V(Mac)を押してください:

source: - Be ordered by position
ja: - 位置によって順序づけられます

source: Execute individual job (mostly for debugging) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 個々のジョブを実行する (たいていデバッグ目的) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: When your web browser is open on a board, Kanboard checks every 10 seconds if something has been changed by someone else.
ja: ブラウザでボードを表示しているときは、Kanboardは10秒ごとに誰かが何かを変更していないかチェックします。

source: This example will return all tasks assigned to me with a due date for tomorrow and a title that contains “my title”:
ja: この例では、タスク名に"my title"を含んでいて、明日が期限で自分に割当てられたタスク全てを返します。

source: - ``%s@kanboard.local`` will be replaced by ``my_user@kanboard.local``
ja: - ``%s@kanboard.local`` は、 ``my_user@kanboard.local`` に置き換えられます

source: // Mysql SSL CA define('DB_SSL_CA', null);
ja: // Mysql のSSL認証局 define('DB_SSL_CA', null);

source: - Result on success: **dict**
ja: - 成功時の返り値: **dict**

source: Define the server name:
ja: サーバー名を決める:

source: Creating Projects -----------------
ja: プロジェクトの作成 -----------------

source: // We define our server settings
ja: // サーバーの設定を定義する

source: - Display the board on a large screen in your office
ja: - オフィス内の大画面にボードを表示する

source: figure:: /_static/link-label-creation.png :alt: Link Label Creation
ja: figure:: /_static/link-label-creation.png :alt: リンクラベルの作成

source: - New internal link = **l**
ja: - 内部リンクを追加 = **l**

source: Example -------
ja: 例 -------

source: Recurring Tasks ---------------
ja: 反復タスク ---------------

source: figure:: /_static/calendar-settings.png :alt: Calendar settings
ja: figure:: /_static/calendar-settings.png :alt: カレンダー設定

source: Fetch user role for this project
ja: プロジェクト上のユーザーの役割を取得する

source: Once the idea is validated, swap it to the “Development” project.
ja: 一旦アイデアを検証してから、"開発"プロジェクトに移します。

source: figure:: /_static/custom-filter-dropdown.png :alt: Custom Filter Dropdown
ja: figure:: /_static/custom-filter-dropdown.png :alt: カスタムフィルタのドロップダウン

source: Security --------
ja: セキュリティ --------

source: - The cycle time is the time between the start date and the date of completion.
ja: - サイクルタイムは、タスクの開始日から、完了するまでの時間です。

source: - Proposal
ja: - 提案

source: Adapt the example above according to your own configuration.
ja: 先ほどの例を参考に、あなたの環境に合わせて設定してください。

source: - Greater than or equal: **due:>=2015-06-29**
ja: - 指定日以降: **due:>=2015-06-29**

source: Swimlanes are horizontal separations in your board.
ja: スイムレーンはボードを水平に区切ります。

source: - **column_id** (integer, optional)
ja: - **column_id** (integer, 任意)

source: If the versions are different, Kanboard will execute one by one each migration until to reach the last version.
ja: バージョンが違う場合、Kanboard は最新版に到達するまで個々のマイグレーションを一つ一つ行います。

source: List of template hooks:
ja: フックのテンプレートのリスト:

source: Search by creation date ~~~~~~~~~~~~~~~~~~~~~~~
ja: 作成日で検索 ~~~~~~~~~~~~~~~~~~~~~~~

source: - Everything is executed inside a transaction, if something doesn’t work a rollback is performed and the error is displayed to the user
ja: - 全ての事はトランザクション内部で実行され、何か問題があればロールバックが実行され、ユーザーにはエラーが表示されます。

source: figure:: /_static/web-notifications.png :alt: Web Notifications
ja: figure:: /_static/web-notifications.png :alt: Web通知

source: # configure the path to php.ini
ja: # php.iniへのパスを設定する

source: Kanboard support batch requests, so you can make multiple API calls in a single HTTP request.
ja: Kanboardはバッチ処理をサポートしているので、一つのHTTPリクエストで複数のAPI呼び出しを行う事ができます。

source: Adding new events -----------------
ja: 新しいイベントを追加する -----------------

source: ## Title level 2
ja: ## 見出し level 2

source: HTTP Client -----------
ja: HTTP クライアント -----------

source: - Parameters: none
ja: - パラメータ: 無し

source: - Since the version 1.2.13, Kanboard requires at least PHP 7.2
ja: - Kanboard 1.2.13 以降では、PHP 7.2 以降が必要になります。

source: warning:: Please, do not update the software blindly without reading the `ChangeLog <https://github.com/kanboard/kanboard/blob/master/ChangeLog>`_.
ja: 警告:: `ChangeLog <https://github.com/kanboard/kanboard/blob/master/ChangeLog>`_ を読まずにアップデートしないでください。

source: You can define tags globally for all projects or only for a specific project.
ja: 全てのプロジェクトに共通するタグも、特定のプロジェクト用のタグも定義することができます。

source: - Choose action: **Close a task in a specific column**
ja: - アクション: **特定のカラムのタスクを完了させる** を選択

source: - Purpose: **Get all available users**
ja: - 用途: **有効な全てのユーザーを取得する**

source: - Each user has its own calendar.
ja: - ユーザー毎に自身のためのカレンダーもあります。

source: Configuration ~~~~~~~~~~~~~
ja: 設定 ~~~~~~~~~~~~~

source: - The lead time is the time between the task creation and the date of completion (task closed).
ja: - リードタイムは、タスクがつくられてから、完了するまでの間の時間です。

source: // LDAP server hostname define('LDAP_SERVER', 'myserver.kanboard.local');
ja: // LDAP サーバーのホスト名 define('LDAP_SERVER', 'myserver.kanboard.local');

source: The file ``app/Schema/Sql/mysql.sql`` is a SQL dump that represents the last version of the database.
ja: ``app/Schema/Sql/mysql.sql`` ファイルは、データベースの最終バージョンに相当するSQLダンプです。

source: Link API Procedures ===================
ja: リンクのAPIプロシージャ ===================

source: Filter Creation ~~~~~~~~~~~~~~~
ja: フィルタの作成 ~~~~~~~~~~~~~~~

source: In order to run these tests you must have `Selenium Standalone Server <http://www.seleniumhq.org/download/>`__ installed, and a compatible version of Firefox.
ja: これらのテストの実行を指示するには `Selenium Standalone Server <http://www.seleniumhq.org/download/>`__ がインストールされている必要があり、また互換性のあるバージョンのFirefoxが必要です。

source: - Project Member
ja: - プロジェクトメンバー

source: - The first argument is the event name (string)
ja: - 最初の引数はイベント名 (string) です。

source: The base date for the calculation of the new due date can be either the existing due date, or the action date.
ja: 新しい期限を計算するための基準日は、既存の予定日か、実行日のどちらかを使用できます。

source: // Override API token stored in the database, useful for automated tests
ja: // 自動テスト用に、データベースに保存されているトークンをオーバーライドするAPIトークン

source: Line Breaks -----------
ja: 改行 -----------

source: Adding your Kanboard Calendar to Mozilla Thunderbird ----------------------------------------------------
ja: Kanboard のカレンダーをMozilla Thunderbirdに追加する ----------------------------------------------------

source: // Mail transport to use: "smtp", "sendmail" or "mail" (PHP mail function) define('MAIL_TRANSPORT', 'mail');
ja: // メールの送信方法を"smtp", "sendmail" , "mail" (PHP のメール関数) から選択 define('MAIL_TRANSPORT', 'mail');

source: - Query to find open tasks: ``status:open``
ja: - 未完了タスクを検索: ``status:open``

source: This feature is optional and require the installation of a queue daemon on your server.
ja: この追加の機能にはサーバーにキューデーモンのインストールが必要です。

source: - **time_estimated** (int, optional)
ja: - **time_estimated** (int, 任意)

source: - Ready to send
ja: - 発送準備済

source: User Provider -------------
ja: ユーザープロバイダ -------------

source: Devices ~~~~~~~
ja: デバイス ~~~~~~~

source: Kanboard uses the protocol Json-RPC to interact with external programs.
ja: Kanboardは外部プログラムと対話するプロトコルに Json-RPC を使用します。

source: - Note: **The maximum file size depends of your PHP configuration, this method should not be used to upload large files**
ja: - 注意: **添付可能な最大ファイルサイズはPHPの設定によるため、この方法では大きなファイルをアップロードすることができません**

source: - Purpose: **Update column properties**
ja: - 用途: **カラムのプロパティのアップデート**

source: The user account can be locked down for the configured period of time and a captcha can be shown to avoid brute force attacks.
ja: 総当たり攻撃を回避するため、設定された上限に達した時にユーザーアカウントがロックされ、captcha認証が表示されます。

source: Register your helper class:
ja: ヘルパーのクラスを登録する:

source: There are two kinds of notifications: project and user.
ja: 通知には2種類あります: プロジェクトとユーザーです。

source: Note: The logged user who performs the action doesn’t receive any notifications, only other project members.
ja: 注意: 操作を実行したログインユーザーには通知は送信されず、それ以外のプロジェクトメンバーのみが通知を受け取ります。

source: - Attachment (PDF documents stored on the web, archive…)
ja: - 添付ファイル (web上に保存されているPDF文書、アーカイブ…)

source: // TOTP (2FA) issuer name
ja: // TOTP (二要素認証) のissuer name

source: Go to the third step just above
ja: 上述の3番に進む

source: - Go to the board of the project #2: **/b/2**
ja: - プロジェクト #2 のボードを表示: **/b/2**

source: - If the method ``getInternalId()`` return a value no synchronization is performed
ja: - ``getInternalId()`` の返り値があった場合、その値は同期が実行されません。

source: - An event to listen
ja: - イベントを監視

source: - `Reverse-Proxy Authentication with LDAP support <https://github.com/kanboard/plugin-reverse-proxy-ldap>`__
ja: - `LDAP をサポートした リバースプロキシ認証 <https://github.com/kanboard/plugin-reverse-proxy-ldap>`__

source: This code has to be provided by a compatible software usually installed on your smartphone or a different device.
ja: このコードはスマートフォンか別のデバイスにインストールされている、互換性のあるソフトウェアから供給されます。

source: - That require different skill set than developing a web application.
ja: - これにはwebアプリケーションの開発とは違ったスキルが必要になります。

source: | Header 1 | Header 2 |
ja: | ヘッダー 1 |ヘッダー 2 |

source: - **French translations are always up to date**
ja: - **フランス語の翻訳ファイルは常に最新です**

source: // Put an empty string to disable language sync
ja: // 言語を同期させないため、空の文字列を入れる

source: - Always use the last version (master branch)
ja: - 常に最新バージョン (master ブランチ)を使用してください。

source: On the project permissions page, people can enter groups in the auto-complete field and Kanboard can search for groups with any provider enabled.
ja: プロジェクトの権限ページで、オートコンプリートのフィールドでグループを入力でき、Kanboardは有効化済みの外部プロバイダのグループを検索できます。

source: // MySQL SSL certificate define('DB_SSL_CERT', '/path/to/client-cert.pem');
ja: // MySQL SSL 証明書 define('DB_SSL_CERT', '/path/to/client-cert.pem');

source: Available Restrictions ~~~~~~~~~~~~~~~~~~~~~~
ja: 利用可能な制限 ~~~~~~~~~~~~~~~~~~~~~~

source: # Push the code to Heroku (You can also use SSH if git over HTTP doesn't work) heroku create git push heroku master
ja: # Herokuにコードをpushする (git over HTTP が使用できない場合、SSHも使用可能) heroku create git push heroku master

source: Your automatic action is identified in Kanboard by using the absolute class name with the name space included.
ja: Kanboardは名前空間を含む絶対的なクラス名であなたの自動アクションを識別します。

source: - Override time spent calculation when sub-task timer is stopped
ja: - サブタスクのタイマーが止まった時、消費時間の計算をオーバーライドする

source: # Run tests with Mysql
ja: # Mysqlでのテスト

source: You can add screenshots directly from the board by clicking on the dropdown menu or in the task view page.
ja: タスクのドロップダウンメニューかタスクビューのページ内から、直接スクリーンショットを追加できます。

source: With the preview link, you can see the task description converted from the Markdown syntax.
ja: 「プレビュー」リンクを使用すると、タスクの詳細をMarkdown記法から変換したものを確認できます。

source: Kanboard can handle multiple projects.
ja: Kanboardは複数のプロジェクトを扱えます

source: Usage examples:
ja: 使用例:

source: trigger:tasks Trigger scheduler event for all tasks
ja: trigger:tasks 全てのタスクのイベントのトリガーのスケジューラー

source: Install Apache:
ja: Apache をインストールする:

source: Use these constants in your config file:
ja: 設定ファイル内でこれらの定数を使用します:

source: // Mysql SSL certificate define('DB_SSL_CERT', null);
ja: // Mysql のSSL 証明書 define('DB_SSL_CERT', null);

source: - Italic text: Use 1 asterisk or 1 underscore
ja: - 斜体: 1つのアスタリスク(&#42;)か、1つのアンダーバー(&#095;)を使用します

source: For example, this is a known issue if you meet these criteria:
ja: 例えば、これらに該当する既知の問題があります:

source: // MySQL SSL key define('DB_SSL_KEY', '/path/to/client-key.pem');
ja: // MySQL SSL キー define('DB_SSL_KEY', '/path/to/client-key.pem');

source: - Purpose: **Remove a project metadata**
ja: - 用途: **プロジェクトのメタデータを削除する**

source: External Task Providers =======================
ja: 外部タスクのプロバイダ =======================

source: If you remove a specific user, **tasks assigned to this person will be unassigned** after the operation.
ja: 特定のユーザーを削除した後には、 **その人に割当てられていたタスクが未割当になります**

source: Kanboard is able to send notifications through several channels:
ja: Kanboard はいくつかのチャンネルを通して通知を送ることができます:

source: User API Procedures ===================
ja: ユーザーAPIのプロシージャ ===================

source: “Merge hooks” act in the same way as the function ``array_merge``.
ja: “フックのマージ” の挙動は ``array_merge`` 関数と同様です。

source: - Purpose: **Create and upload a new task attachment**
ja: - 用途: **新しくタスクに添付ファイルをアップロード・作成する**

source: Kanboard uses a simple query language for advanced search.
ja: Kanboardは詳細検索のために簡単なクエリ言語を使用します。

source: Open the file corresponding to your database ``app/Schema/Sqlite.php`` or ``app/Schema/Mysql.php`` 2.
ja: 使用しているデータベースに応じて、 ``app/Schema/Sqlite.php`` or ``app/Schema/Mysql.php`` を開く 2.

source: It’s useful if you always create projects with the same columns.
ja: これは、いつも同じカラムでプロジェクトを作る場合に便利です。

source: - Query to search by color name: ``color:"Deep Orange"``
ja: - 色名で検索: ``color:"Deep Orange"``

source: To run database migrations manually, set the parameter ``DB_RUN_MIGRATIONS`` at ``false`` in your config file.
ja: データベースのマイグレーションを手動で行うには、設定ファイル中の ``DB_RUN_MIGRATIONS`` パラメータを ``false`` にしてください。

source: - Choose the event: **Task assignee change**
ja: - イベント: **担当者の変更** を選択

source: Each label may have an opposite label defined.
ja: 各々のラベルには対になるラベルを定義できます。

source: - The time calculated is rounded to the nearest quarter.
ja: - 計算される時間は15分単位の最接近丸めです。

source: With Kanboard, you can associate one or many tags to a task.
ja: Kanboardでは、一つ、または多数のタグとタスクを関連付けることができます。

source: Custom filters allow you to save any search query.
ja: カスタムフィルタはどんな検索クエリも保存できます。

source: Any templates defined in the core can be overridden.
ja: どんなテンプレートでもコア内で定義されていて、オーバーライドできます。

source: - **name** (string, optional)
ja: - **name** (string, 任意)

source: - **tags** ([]string, optional)
ja: - **tags** ([]string, 任意)

source: // Example for ActiveDirectory: 'samaccountname'
ja: // ActiveDirectoryでの例: 'samaccountname'

source: By default the sendmail command will be ``/usr/sbin/sendmail -bs`` but you can customize that in your config file.
ja: デフォルトのsendmailコマンドは ``/usr/sbin/sendmail -bs`` ですが、設定ファイルでカスタマイズできます。

source: - Purpose: **Create an action**
ja: - 用途: **アクションを作成する**

source: Registering the action ----------------------
ja: アクションを登録する ----------------------

source: `PHPUnit <https://phpunit.de/>`__ is used to run automated tests on Kanboard.
ja: `PHPUnit <https://phpunit.de/>`__ がKanboardの自動テストに使用されます。

source: Each project can have different categories.
ja: 各々のプロジェクトに異なるカテゴリを持たせることができます。

source: - Purpose: **Set a task to the status close**
ja: - 用途: **タスクの状態を終了にする**

source: - Result on success: **list of groups**
ja: - 成功時の返り値: **グループのリスト**

source: Hello (<-- two spaces)
ja: Hello (<-- 2連続のスペース)

source: - Occasional contributors can checkout the source code and work on a patch without having to worry about all Composer dependencies.
ja: - 時折コントリビューターはソースコードをチェックアウトして、全てのコンポーザーの依存関係の心配をせずにパッチを当てて動かします。

source: Default columns for new projects ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 新規プロジェクトのためのデフォルトのカラム ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: The schema version is checked at each request.
ja: スキーマのバージョンはリクエストの都度確認されます。

source: Installation Instructions =========================
ja: インストール手順の説明 =========================

source: Which database to choose?
ja: どのデータベースを選べば良いですか？

source: General Advices ---------------
ja: 一般的な勧告 ---------------

source: - Do not use Sqlite on a shared NFS mount
ja: - 共有NFSマウント上のSqliteを使用しない

source: From the user interface ~~~~~~~~~~~~~~~~~~~~~~~
ja: ユーザーインターフェースから ~~~~~~~~~~~~~~~~~~~~~~~

source: Create a new file for the translation: ``app/Locale/xx_XX/translations.php`` 3.
ja: 新しく翻訳ファイルを作成する: ``app/Locale/xx_XX/translations.php`` 3.

source: - Purpose: **Get the dashboard of the logged user without pagination**
ja: - 用途: **ページ付けの無い、ログイン中のユーザーでダッシュボードを取得**

source: Clone the Kanboard repository and run the following command:
ja: Kanboardのリポジトリをクローンして、以下のコマンドを実行する*

source: Reference hooks are passing a variable by reference.
ja: フックの参照は、変数の参照はパスされます。

source: Requirements ~~~~~~~~~~~~
ja: 必要要件 ~~~~~~~~~~~~

source: Those labels can be changed in the application settings.
ja: これらのラベルはアプリケーション設定内で変更できます。

source: - Purpose: **Get a link by label**
ja: - Purpose: **リンクをラベルから取得する**

source: This pie chart gives an overview of the number of open tasks per column.
ja: この円グラフは、各コラムにある未完了タスクの概要を表示します。

source: Search by modification date ~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 変更日で検索 ~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Usually on Unix platforms, this process is done by ``cron``.
ja: しばしばUnixプラットフォーム上では、このプロセスは``cron``が実行します。

source: // Lock the account after 6 authentication failure define('BRUTEFORCE_LOCKDOWN', 6);
ja: // 6回認証に失敗した後はアカウントをロックする define('BRUTEFORCE_LOCKDOWN', 6);

source: Create a config file ~~~~~~~~~~~~~~~~~~~~
ja: 設定ファイルの作成 ~~~~~~~~~~~~~~~~~~~~

source: - This is up to the Kanboard instance owner to validate if a plugin is legit.
ja: - プラグインが正当性を検証するのはKanboardのインスタンスの所有者です。

source: On the top, you have a link **New local user** or **New remote user** 3.
ja: 上部の **新規ユーザー** のリンクを開いてください。 3.

source: Generally 3 elements have to be installed:
ja: 一般的に、 3つのパッケージをインストールしなければなりません:

source: The virtual machine is based on Ubuntu 20.04 and PHP 7.4.
ja: この仮想マシンはUbuntu 20.04とPHP 7.4 がベースになっています。

source: :alt: Task timesheet
ja: :alt: タスクのタイムシート

source: - Search by task title: anything that doesn’t match any search attributes
ja: - タスク名で検索: 他の属性での検索でマッチしない物を何でも検索。

source: - Purpose: **Get all overdue tasks for a special project**
ja: - 用途: **プロジェクトの期限切れタスクを取得する**

source: Command Line Interface ======================
ja: コマンドラインインターフェースについて ======================

source: - Purpose: **Add a new column**
ja: - 用途: **新しいカラムを追加する**

source: - Purpose: **Get activity stream for a project**
ja: - 用途: **プロジェクトのアクティビティを取得する**

source: We use the `version 2 of the protocol <http://www.jsonrpc.org/specification>`__.
ja: 我々は `JSON-RPC 2.0 <http://www.jsonrpc.org/specification>`__ を使用します。

source: - Make sure the unit tests pass.
ja: - ユニットテストの合格を確かめてください。

source: Limit your work in progress ~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 仕掛の制限 ~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - RSS feed subscription link
ja: - RSS フィードのリンク

source: Kanboard will scan the directory ``plugins`` and load automatically everything under this directory.
ja: Kanboardは ``plugins`` ディレクトリをスキャンし、ディレクトリ以下にある物を自動的にロードします。

source: // Hide login form, useful if all your users use Google/Github/ReverseProxy authentication
ja: // ログインフォームの非表示。全てのユーザーがGoogle/Github/リバースプロキシ認証を使用する場合に有用。

source: help Displays help for a command
ja: help コマンドのヘルプを画面に表示する

source: // Enable captcha after 3 authentication failure
ja: // 3 回認証に失敗した場合にcaptcha認証を行う

source: This is the default value but some LDAP servers don’t allow anonymous browsing for security reasons.
ja: これはデフォルトの値ですが、いくつかのLDAPサーバーはセキュリティ上の理由によりanonymous ブラウズを容認しません。

source: From the repository (development version) -----------------------------------------
ja: リポジトリからインストール (開発版) -----------------------------------------

source: Try first to authenticate the user by using the database 2.
ja: 最初に、データベースを使用してユーザーの認証を試みます。 2.

source: In Kanboard there are two types of users:
ja: Kanboard には、2つのタイプのユーザーがあります:

source: Can you recommend a web hosting provider for Kanboard?
ja: Kanboardをホスティングするのにお勧めのサービスはどこですか？

source: How to change attachment size limit?
ja: 添付ファイルのサイズ上限を変更するには?

source: Events triggered:
ja: トリガされるイベント:

source: By default, all operations are synchronous and performed in the same thread as the HTTP request.
ja: デフォルトでは、HTTPリクエスト同様にすべての動作と同期を同じスレッドで実行します。

source: - Changing subtask status from **todo** to **in progress** logs the start time
ja: - サブタスクの状態が **todo** から **in progress** に変更された時、開始時間を記録します。

source: Example: ``createdRange:2018/01/21..2018/01/31`` or ``createdRange:"2018-01-21..2018-01-31"``
ja: 例: ``createdRange:2018/01/21..2018/01/31`` か ``createdRange:"2018-01-21..2018-01-31"``

source: - If the start date is not specified, the cycle time is not calculated.
ja: - 開始日が指定されていない場合、サイクルタイムは計算されません。.

source: Projects can be modified at any time.
ja: プロジェクトは随時変更できます。

source: The ``GroupManager`` class will execute the query across all registered group providers 3.
ja: ``GroupManager`` クラスが全てのグループプロバイダに跨ってクエリを実行する 3.

source: - Changing existing code will require too many changes.
ja: - そのために既存のコードを変更するには、変更箇所が多すぎます。
